In [7]:
import pandas as pd
import numpy as np

In [8]:
yen = [
    300000, 340000, 320000, 360000, 
    440000, 140000, 180000, 340000, 
    330000, 290000, 280000, 380000, 
    170000, 140000, 230000, 390000, 
    400000, 350000, 380000, 150000, 
    110000, 240000, 380000, 380000, 
    340000, 420000, 150000, 130000, 
    360000, 320000, 250000
]

yen = np.array(yen)

under_20 = yen <= 200000
print(yen[under_20])

[140000 180000 170000 140000 150000 110000 150000 130000]

In [9]:
name = ['yn','lim','kim']
job = ['what','developer','planner']
dic = {
    'name':name,
    'job':job
}
dict2 = pd.DataFrame(dic,columns = ['name', 'job'])
dict2

  name        job
0   yn       what
1  lim  developer
2  kim    planner

In [10]:
sam = pd.read_csv('C:/codeit/samsong.csv')
hyun = pd.read_csv('C:/codeit/hyundee.csv')

sikbi = pd.DataFrame({
    '요일':sam['요일'],
    'samsong':sam['식비'],
    'hyundee':hyun['식비']}
        )
sikbi

# 오늘 배운 것중 제일 쓸모있따.

    요일  samsong  hyundee
0  MON    19420    22420
1  TUE    16970    19940
2  WED    15091    18086
3  THU    17880    18863
4  FRI    27104    35144
5  SAT    29055    34952
6  SUN    23509    28513

In [11]:
df = pd.read_csv('C:/codeit/iphone.csv', index_col = 0)

df['메모리':'Face ID']
#원하는 대로 안나와
df.loc[:,'메모리':'Face ID']
# 컬럼의 인덱싱은 요러케 해주어야 한다

               메모리     출시 버전 Face ID
iPhone 7       2GB  iOS 10.0      No
iPhone 7 Plus  3GB  iOS 10.0      No
iPhone 8       2GB  iOS 11.0      No
iPhone 8 Plus  3GB  iOS 11.0      No
iPhone X       3GB  iOS 11.1     Yes
iPhone XS      4GB  iOS 12.0     Yes
iPhone XS Max  4GB  iOS 12.0     Yes